# IfcApplicationName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcApplicationName Property
ParameterTypeId Class See Also
---
"IfcApplicationName"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcApplicationName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcApplicationName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcApplicationName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace